Repository: Black-coffe/tldr-pro-wordpress-plugin
Catalog: languages/tldr-pro-*.po
Languages: ru_ru, uk

source: TL;DR Pro - AI Content Summaries
ru_ru: TL;DR Pro - ИИ Резюме Контента
uk: TL;DR Pro - AI Резюме Контенту

source: Automatically generate intelligent summaries for WordPress posts and pages using AI. Improve user engagement with quick, scannable content previews.
ru_ru: Автоматически создавайте интеллектуальные резюме для записей и страниц WordPress с помощью ИИ. Улучшите вовлеченность пользователей с помощью быстрых обзоров контента.
uk: Автоматично створюйте інтелектуальні резюме для записів і сторінок WordPress за допомогою ШІ. Покращте залучення користувачів за допомогою швидких оглядів контенту.

source: Your Name
ru_ru: Ваше Имя
uk: Ваше Ім'я

source: Settings
ru_ru: Настройки
uk: Налаштування

source: Bulk Operations
ru_ru: Массовые операции
uk: Масові операції

source: Statistics
ru_ru: Статистика
uk: Статистика

source: TL;DR Pro Settings
ru_ru: Настройки TL;DR Pro
uk: Налаштування TL;DR Pro

source: General
ru_ru: Общие
uk: Загальні

source: AI Providers
ru_ru: Провайдеры ИИ
uk: Провайдери ШІ

source: Display
ru_ru: Отображение
uk: Відображення

source: Advanced
ru_ru: Расширенные
uk: Розширені

source: Active AI Provider
ru_ru: Активный провайдер ИИ
uk: Активний провайдер ШІ

source: Summary Language
ru_ru: Язык резюме
uk: Мова резюме

source: Maximum Summary Length
ru_ru: Максимальная длина резюме
uk: Максимальна довжина резюме

source: words
ru_ru: слов
uk: слів

source: Use Emojis in Summaries
ru_ru: Использовать эмодзи в резюме
uk: Використовувати емодзі в резюме

source: Auto-generate on Post Save
ru_ru: Автоматически генерировать при сохранении записи
uk: Автоматично генерувати при збереженні запису

source: Minimum Word Count
ru_ru: Минимальное количество слов
uk: Мінімальна кількість слів

source: Button Position
ru_ru: Позиция кнопки
uk: Позиція кнопки

source: Before Content
ru_ru: Перед контентом
uk: Перед контентом

source: After Content
ru_ru: После контента
uk: Після контенту

source: Both
ru_ru: Обе
uk: Обидві

source: Button Text
ru_ru: Текст кнопки
uk: Текст кнопки

source: Enable Floating Button
ru_ru: Включить плавающую кнопку
uk: Увімкнути плаваючу кнопку

source: Save Settings
ru_ru: Сохранить настройки
uk: Зберегти налаштування

source: Reset to Defaults
ru_ru: Сбросить до стандартных
uk: Скинути до стандартних

source: Bulk Summary Generation
ru_ru: Массовая генерация резюме
uk: Масова генерація резюме

source: Select Posts
ru_ru: Выбрать записи
uk: Вибрати записи

source: Title
ru_ru: Заголовок
uk: Заголовок

source: Status
ru_ru: Статус
uk: Статус

source: Summary
ru_ru: Резюме
uk: Резюме

source: Has Summary
ru_ru: Имеет резюме
uk: Має резюме

source: No Summary
ru_ru: Нет резюме
uk: Немає резюме

source: Generate Selected
ru_ru: Сгенерировать выбранные
uk: Згенерувати вибрані

source: Delete Selected
ru_ru: Удалить выбранные
uk: Видалити вибрані

source: TL;DR Pro Statistics
ru_ru: Статистика TL;DR Pro
uk: Статистика TL;DR Pro

source: Overview
ru_ru: Обзор
uk: Огляд

source: Total Summaries
ru_ru: Общее количество резюме
uk: Загальна кількість резюме

source: Provider Usage
ru_ru: Использование провайдера
uk: Використання провайдера

source: Language Distribution
ru_ru: Распределение по языкам
uk: Розподіл за мовами

source: Recent Summaries
ru_ru: Последние резюме
uk: Останні резюме

source: Failed to load summary
ru_ru: Не удалось загрузить резюме
uk: Не вдалося завантажити резюме

source: Network error. Please try again.
ru_ru: Ошибка сети. Пожалуйста, попробуйте еще раз.
uk: Помилка мережі. Будь ласка, спробуйте ще раз.

source: TL;DR Summary
ru_ru: TL;DR Резюме
uk: TL;DR Резюме

source: Error loading summary
ru_ru: Ошибка загрузки резюме
uk: Помилка завантаження резюме

source: TL;DR Pro activated successfully.
ru_ru: TL;DR Pro успешно активирован.
uk: TL;DR Pro успішно активовано.

source: TL;DR Pro deactivated.
ru_ru: TL;DR Pro деактивирован.
uk: TL;DR Pro деактивовано.

source: No AI provider configured
ru_ru: Не настроен провайдер ИИ
uk: Не налаштовано провайдера ШІ

source: API key not configured for provider: %s
ru_ru: API ключ не настроен для провайдера: %s
uk: API ключ не налаштовано для провайдера: %s

source: DeepSeek API key is not configured
ru_ru: API ключ DeepSeek не настроен
uk: API ключ DeepSeek не налаштовано

source: Google Gemini API key is not configured
ru_ru: API ключ Google Gemini не настроен
uk: API ключ Google Gemini не налаштовано

source: Auto-generation failed for post %d: %s
ru_ru: Автоматическая генерация не удалась для записи %d: %s
uk: Автоматична генерація не вдалася для запису %d: %s

source: Summary auto-generated for post %d
ru_ru: Резюме автоматически сгенерировано для записи %d
uk: Резюме автоматично згенеровано для запису %d
